app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New name"], ["email", "new@example.com"], ["password_digest", "$2a$04$mZ99JIbdMh9RPuwMbKwsZ.N23HhQPbmQaNp0tDtqNbIPwwQfIIH7C"], ["updated_at", Fri, 10 Jan 2014 10:47:11 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
  if @user.update_attributes(user_params)

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.paginate(page: params[:page])